MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB106/mcu.h
extern volatile CNPD2BITS CNPD2bits __attribute__((__sfr__));

#define CNPD3 CNPD3
extern volatile uint16_t CNPD3 __attribute__((__sfr__));
typedef struct tagCNPD3BITS {
  uint16_t CN32PDE:1;
} CNPD3BITS;
extern volatile CNPD3BITS CNPD3bits __attribute__((__sfr__));

#define CNPD4 CNPD4
extern volatile uint16_t CNPD4 __attribute__((__sfr__));
typedef struct tagCNPD4BITS {
  uint16_t :1;
  uint16_t CN49PDE:1;
  uint16_t CN50PDE:1;
  uint16_t CN51PDE:1;
  uint16_t CN52PDE:1;
  uint16_t CN53PDE:1;
  uint16_t CN54PDE:1;
  uint16_t CN55PDE:1;
  uint16_t CN56PDE:1;
  uint16_t :1;
  uint16_t CN58PDE:1;
  uint16_t CN59PDE:1;
  uint16_t CN60PDE:1;
  uint16_t CN61PDE:1;
  uint16_t CN62PDE:1;
  uint16_t CN63PDE:1;
} CNPD4BITS;
extern volatile CNPD4BITS CNPD4bits __attribute__((__sfr__));

#define CNPD5 CNPD5
extern volatile uint16_t CNPD5 __attribute__((__sfr__));
typedef struct tagCNPD5BITS {
  uint16_t CN64PDE:1;
  uint16_t CN65PDE:1;
  uint16_t :2;
  uint16_t CN68PDE:1;
  uint16_t CN69PDE:1;
  uint16_t :1;
  uint16_t CN71PDE:1;
} CNPD5BITS;
extern volatile CNPD5BITS CNPD5bits __attribute__((__sfr__));

#define CNEN1 CNEN1
extern volatile uint16_t CNEN1 __attribute__((__sfr__));
typedef struct tagCNEN1BITS {
  uint16_t CN0IE:1;
  uint16_t CN1IE:1;
  uint16_t CN2IE:1;
  uint16_t CN3IE:1;
  uint16_t CN4IE:1;
  uint16_t CN5IE:1;
  uint16_t CN6IE:1;
  uint16_t CN7IE:1;
  uint16_t CN8IE:1;
  uint16_t CN9IE:1;
  uint16_t CN10IE:1;
  uint16_t CN11IE:1;
  uint16_t CN12IE:1;
  uint16_t CN13IE:1;
  uint16_t CN14IE:1;
  uint16_t CN15IE:1;
} CNEN1BITS;
extern volatile CNEN1BITS CNEN1bits __attribute__((__sfr__));

#define CNEN2 CNEN2
extern volatile uint16_t CNEN2 __attribute__((__sfr__));
typedef struct tagCNEN2BITS {
  uint16_t CN16IE:1;
  uint16_t CN17IE:1;
  uint16_t CN18IE:1;
  uint16_t :3;
  uint16_t CN22IE:1;
  uint16_t CN23IE:1;
  uint16_t CN24IE:1;
  uint16_t CN25IE:1;
  uint16_t CN26IE:1;
  uint16_t CN27IE:1;
  uint16_t CN28IE:1;
  uint16_t CN29IE:1;
  uint16_t CN30IE:1;
  uint16_t CN31IE:1;
} CNEN2BITS;
extern volatile CNEN2BITS CNEN2bits __attribute__((__sfr__));

#define CNEN3 CNEN3
extern volatile uint16_t CNEN3 __attribute__((__sfr__));
typedef struct tagCNEN3BITS {
  uint16_t CN32IE:1;
} CNEN3BITS;
extern volatile CNEN3BITS CNEN3bits __attribute__((__sfr__));

#define CNEN4 CNEN4
extern volatile uint16_t CNEN4 __attribute__((__sfr__));
typedef struct tagCNEN4BITS {
  uint16_t :1;
  uint16_t CN49IE:1;
  uint16_t CN50IE:1;
  uint16_t CN51IE:1;
  uint16_t CN52IE:1;
  uint16_t CN53IE:1;
  uint16_t CN54IE:1;
  uint16_t CN55IE:1;
  uint16_t CN56IE:1;
  uint16_t :1;
  uint16_t CN58IE:1;
  uint16_t CN59IE:1;
  uint16_t CN60IE:1;
  uint16_t CN61IE:1;
  uint16_t CN62IE:1;
  uint16_t CN63IE:1;
} CNEN4BITS;
extern volatile CNEN4BITS CNEN4bits __attribute__((__sfr__));

#define CNEN5 CNEN5
extern volatile uint16_t CNEN5 __attribute__((__sfr__));
typedef struct tagCNEN5BITS {
  uint16_t CN64IE:1;
  uint16_t CN65IE:1;
  uint16_t :2;
  uint16_t CN68IE:1;
  uint16_t CN69IE:1;
  uint16_t :1;
  uint16_t CN71IE:1;
} CNEN5BITS;
extern volatile CNEN5BITS CNEN5bits __attribute__((__sfr__));

#define CNPU1 CNPU1
extern volatile uint16_t CNPU1 __attribute__((__sfr__));
typedef struct tagCNPU1BITS {
  uint16_t CN0PUE:1;
  uint16_t CN1PUE:1;
  uint16_t CN2PUE:1;
  uint16_t CN3PUE:1;
  uint16_t CN4PUE:1;
  uint16_t CN5PUE:1;
  uint16_t CN6PUE:1;
  uint16_t CN7PUE:1;
  uint16_t CN8PUE:1;
  uint16_t CN9PUE:1;
  uint16_t CN10PUE:1;
  uint16_t CN11PUE:1;
  uint16_t CN12PUE:1;
  uint16_t CN13PUE:1;
  uint16_t CN14PUE:1;
  uint16_t CN15PUE:1;
} CNPU1BITS;
extern volatile CNPU1BITS CNPU1bits __attribute__((__sfr__));

#define CNPU2 CNPU2
extern volatile uint16_t CNPU2 __attribute__((__sfr__));
typedef struct tagCNPU2BITS {
  uint16_t CN16PUE:1;
  uint16_t CN17PUE:1;
  uint16_t CN18PUE:1;
  uint16_t :3;
  uint16_t CN22PUE:1;
  uint16_t CN23PUE:1;
  uint16_t CN24PUE:1;
  uint16_t CN25PUE:1;
  uint16_t CN26PUE:1;
  uint16_t CN27PUE:1;
  uint16_t CN28PUE:1;
  uint16_t CN29PUE:1;
  uint16_t CN30PUE:1;
  uint16_t CN31PUE:1;
} CNPU2BITS;
extern volatile CNPU2BITS CNPU2bits __attribute__((__sfr__));

#define CNPU3 CNPU3
extern volatile uint16_t CNPU3 __attribute__((__sfr__));
typedef struct tagCNPU3BITS {
  uint16_t CN32PUE:1;
} CNPU3BITS;
extern volatile CNPU3BITS CNPU3bits __attribute__((__sfr__));

#define CNPU4 CNPU4
extern volatile uint16_t CNPU4 __attribute__((__sfr__));
typedef struct tagCNPU4BITS {
  uint16_t :1;
  uint16_t CN49PUE:1;
  uint16_t CN50PUE:1;
  uint16_t CN51PUE:1;
  uint16_t CN52PUE:1;
  uint16_t CN53PUE:1;
  uint16_t CN54PUE:1;
  uint16_t CN55PUE:1;
  uint16_t CN56PUE:1;
  uint16_t :1;
  uint16_t CN58PUE:1;
  uint16_t CN59PUE:1;
  uint16_t CN60PUE:1;
  uint16_t CN61PUE:1;
  uint16_t CN62PUE:1;
  uint16_t CN63PUE:1;
} CNPU4BITS;
extern volatile CNPU4BITS CNPU4bits __attribute__((__sfr__));

#define CNPU5 CNPU5
extern volatile uint16_t CNPU5 __attribute__((__sfr__));
typedef struct tagCNPU5BITS {
  uint16_t CN64PUE:1;
  uint16_t CN65PUE:1;
  uint16_t :2;
  uint16_t CN68PUE:1;
  uint16_t CN69PUE:1;
  uint16_t :1;
  uint16_t CN71PUE:1;
} CNPU5BITS;
extern volatile CNPU5BITS CNPU5bits __attribute__((__sfr__));

#define INTCON1 INTCON1
extern volatile uint16_t INTCON1 __attribute__((__sfr__));
typedef struct tagINTCON1BITS {
  uint16_t :1;
  uint16_t OSCFAIL:1;
  uint16_t STKERR:1;
  uint16_t ADDRERR:1;
  uint16_t MATHERR:1;
  uint16_t :10;
  uint16_t NSTDIS:1;
} INTCON1BITS;
extern volatile INTCON1BITS INTCON1bits __attribute__((__sfr__));

#define INTCON2 INTCON2
extern volatile uint16_t INTCON2 __attribute__((__sfr__));
typedef struct tagINTCON2BITS {
  uint16_t INT0EP:1;
  uint16_t INT1EP:1;
  uint16_t INT2EP:1;
  uint16_t INT3EP:1;
  uint16_t INT4EP:1;
  uint16_t :9;
  uint16_t DISI:1;
  uint16_t ALTIVT:1;
} INTCON2BITS;
extern volatile INTCON2BITS INTCON2bits __attribute__((__sfr__));

#define IFS0 IFS0
extern volatile uint16_t IFS0 __attribute__((__sfr__));
typedef struct tagIFS0BITS {
  uint16_t INT0IF:1;
  uint16_t IC1IF:1;
  uint16_t OC1IF:1;
  uint16_t T1IF:1;
  uint16_t :1;
  uint16_t IC2IF:1;
  uint16_t OC2IF:1;
  uint16_t T2IF:1;
  uint16_t T3IF:1;
  uint16_t SPF1IF:1;
  uint16_t SPI1IF:1;
  uint16_t U1RXIF:1;
  uint16_t U1TXIF:1;
  uint16_t AD1IF:1;
} IFS0BITS;
